{
  "architectures": [
    "Gemma4ForConditionalGeneration"
  ],
  "audio_config": null,
  "audio_token_id": 258881,
  "boa_token_id": 256000,
  "boi_token_id": 255999,
  "bos_token_id": 2,
  "dtype": "float16",
  "eoa_token_id": 258883,
  "eoa_token_index": 258883,
  "eoi_token_id": 258882,
  "eos_token_id": [
    1,
    106
  ],
  "image_token_id": 258880,
  "initializer_range": 0.02,
  "model_type": "gemma4",
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": true,
    "llm_int8_enable_fp32_cpu_offload": true,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": null,
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_k_eq_v": false,
    "bos_token_id": 2,
    "dtype": "float16",
    "enable_moe_block": false,
    "eos_token_id": 1,
    "expert_intermediate_size": null,
    "final_logit_softcapping": 30.0,
    "global_head_dim": 512,
    "head_dim": 256,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 2560,
    "hidden_size_per_layer_input": 256,
    "initializer_range": 0.02,
    "intermediate_size": 10240,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "max_position_embeddings": 131072,
    "model_type": "gemma4_text",
    "moe_intermediate_size": null,
    "num_attention_heads": 8,
    "num_experts": null,
    "num_global_key_value_heads": null,
    "num_hidden_layers": 42,
    "num_key_value_heads": 2,
    "num_kv_shared_layers": 18,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "full_attention": {
        "partial_rotary_factor": 0.25,
        "rope_theta": 1000000.0,
        "rope_type": "proportional"
      },
      "sliding_attention": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      }
    },
    "sliding_window": 512,
    "tie_word_embeddings": true,
    "top_k_experts": null,
    "use_bidirectional_attention": null,
    "use_cache": true,
    "use_double_wide_mlp": false,
    "vocab_size": 262144,
    "vocab_size_per_layer_input": 262144
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.6.2",
  "video_token_id": 258884,
  "vision_config": null,
  "vision_soft_tokens_per_image": 280
}